{
  "id": "leopard-gecko-lighting-guide",
  "title": "Leopard Gecko Lighting Guide: UVB Requirements & Setup",
  "description": "Comprehensive guide to leopard gecko lighting including UVB requirements, fixture options, morph-specific needs, and photoperiod management.",
  "excerpt": "Comprehensive guide to leopard gecko lighting including UVB requirements, fixture options, morph-specific needs, and photoperiod management.",
  "author": "Habitat Builder",
  "publishDate": "2026-02-11",
  "category": "Environmental Control",
  "tags": ["leopard-gecko", "lighting", "UVB", "photoperiod"],
  "image": "/animals/leopard-gecko/leopard-gecko-6.jpg",
  "status": "community-reviewed",
  "relatedGuides": ["leopard-gecko-temperature-humidity-guide", "leopard-gecko-enclosure-setup"],
  "content": [
    {
      "type": "intro",
      "title": "Lighting Requirements for Leopard Geckos",
      "content": "While historically kept without UVB, modern research demonstrates leopard geckos benefit significantly from UVB exposure. This guide covers proper UVB provision, fixture setup, morph-specific requirements, and photoperiod management for optimal health."
    },
    {
      "type": "section",
      "title": "Why UVB Matters for Leopard Geckos"
    },
    {
      "type": "text",
      "content": "Leopard geckos are crepuscular (most active at sunset and dawn) but still receive natural UVB exposure in the wild. UVB enables vitamin D3 synthesis, which is essential for calcium absorption and immune function."
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Benefits of UVB Provision:</span>"
    },
    {
      "type": "list",
      "items": [
        "<span class='font-semibold'>Calcium Absorption:</span> D3 synthesized from UVB enables efficient calcium uptake, reducing MBD (Metabolic Bone Disease) risk",
        "<span class='font-semibold'>Immune Function:</span> Research shows improved immune response with adequate D3 levels",
        "<span class='font-semibold'>Natural Behavior:</span> Geckos exhibit more naturalistic basking and activity patterns with UVB",
        "<span class='font-semibold'>Reduced Supplementation Dependency:</span> While supplements still required, UVB provides additional D3 pathway",
        "<span class='font-semibold'>Circadian Rhythm:</span> Light cycle helps regulate sleep/wake patterns"
      ]
    },
    {
      "type": "warning",
      "severity": "important",
      "content": "UVB is NOT Optional: While leopard geckos survived without UVB historically, modern husbandry standards recognize UVB as essential for thriving (not just surviving). Veterinary consensus supports UVB provision for all diurnal and crepuscular reptiles."
    },
    {
      "type": "highlight",
      "content": "Leopard Gecko UVB Requirements: Low-level UVB is sufficient. Target UVI (UV Index) of 1.0-2.0 at basking spot for standard morphs, 0.5-0.7 for albino/less-pigmented morphs. This is significantly lower than desert species like bearded dragons (3.0-5.0 UVI)."
    },
    {
      "type": "section",
      "title": "UVB Equipment Options"
    },
    {
      "type": "text",
      "content": "Two primary fixtures work well for leopard geckos: T5 HO 5.0 mounted over mesh screen, OR Arcadia ShadeDweller mounted inside enclosure."
    },
    {
      "type": "table",
      "headers": ["UVB Option", "Specifications", "Mounting", "Pros", "Cons", "Best For"],
      "rows": [
        ["Zoo Med T5 HO ReptiSun 5.0", "24\" fixture for 36\" tank, T5 High Output linear bulb", "On top of mesh screen lid", "Widely available, strong output, covers large area", "Requires mesh screen (blocks ~30% UVB), higher output may require distance adjustment for albinos", "Standard morphs, screen-top enclosures"],
        ["Arcadia ShadeDweller Kit", "7\" fixture, 8w compact bulb designed for low-UVB species", "INSIDE enclosure (under mesh causes too much blocking)", "Purpose-built for crepuscular species, safer for albinos, compact", "Covers smaller area, more expensive than T5 fixture, must ensure gecko cannot touch", "Albino/leucistic morphs, front-opening terrariums without mesh top"],
        ["Arcadia T5 HO 6% Forest (2nd Choice)", "24\" T5 HO linear bulb", "On top of mesh screen OR inside if sufficient distance", "Middle-ground output between 5.0 and ShadeDweller", "Output through mesh may be slightly too strong for albinos without distance increase", "Standard morphs, alternative to Zoo Med 5.0"]
      ]
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Recommended Setup by Morph Type:</span>"
    },
    {
      "type": "list",
      "items": [
        "<span class='font-semibold'>Standard Morphs (Normal, High Yellow, Tangerine, etc.):</span> Zoo Med T5 HO 5.0 (24\" fixture) mounted on mesh screen lid, 10-12\" from basking spot = UVI 1.0-2.0",
        "<span class='font-semibold'>Albino Morphs (Tremper, Bell, Rainwater strains):</span> Increase T5 HO 5.0 distance to 14-16\" from basking spot = UVI 0.5-0.7, OR use Arcadia ShadeDweller instead",
        "<span class='font-semibold'>Leucistic/Blizzard/Super Snow (Minimal Pigmentation):</span> Arcadia ShadeDweller preferred (safest option), OR T5 HO 5.0 at 16-18\" distance = UVI 0.5-0.7",
        "<span class='font-semibold'>Enigma Syndrome Geckos:</span> Standard UVB fine (1.0-2.0 UVI) - ES affects neurological function, not light sensitivity"
      ]
    },
    {
      "type": "warning",
      "severity": "critical",
      "content": "Albino Eye Damage Risk: Albino and less-pigmented morphs lack melanin protection and are highly sensitive to excessive UVB. Prolonged exposure to UVI >1.0 can cause eye damage (photokeratitis). ALWAYS reduce UVB levels for albinos to UVI 0.5-0.7 or use ShadeDweller."
    },
    {
      "type": "section",
      "title": "UVB Installation & Positioning"
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>T5 HO 5.0 Setup (Over Mesh):</span>"
    },
    {
      "type": "list",
      "items": [
        "Mount 24\" T5 fixture on top of screen lid centered over basking area",
        "Ensure fixture runs lengthwise (parallel to long axis of enclosure) for maximum coverage",
        "Position heat lamp adjacent to UVB fixture - gecko should receive heat + UVB simultaneously at basking spot",
        "Measure distance from bulb to basking surface: Target 10-12\" for standard morphs (through mesh), 14-16\" for albinos",
        "Mesh screen blocks ~30% of UVB - factor this into calculations (over mesh reduces effective output)",
        "Connect fixture to timer for automatic 12hr on/off cycle"
      ]
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Arcadia ShadeDweller Setup (Inside Enclosure):</span>"
    },
    {
      "type": "list",
      "items": [
        "Mount 7\" ShadeDweller fixture INSIDE enclosure (not on top of mesh - too much UVB blocked)",
        "Position over or adjacent to basking area - gecko receives UVB while basking",
        "Install guard or mesh cage around bulb - gecko should NOT be able to touch hot bulb directly",
        "Distance: Follow manufacturer guidelines (typically 6-8\" from basking surface for safe UVI level)",
        "Ensure gecko cannot climb on fixture itself (risk of thermal burn from bulb heat)",
        "Connect to timer for 12hr photoperiod"
      ]
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>UVB Overlap with Heat:</span>"
    },
    {
      "type": "list",
      "items": [
        "CRITICAL: UVB fixture must overlap with basking zone - gecko needs to receive heat + UVB simultaneously",
        "In the wild, sun provides both heat and UVB at once - replicate this by positioning fixtures together",
        "Gecko thermoregulating at basking spot automatically receives UVB exposure (no need to move between zones)",
        "If UVB and heat are separated, gecko may choose heat over UVB (prioritizes warmth) and miss UVB exposure"
      ]
    },
    {
      "type": "highlight",
      "content": "Distance is Critical: UVB output follows inverse-square law - doubling distance reduces UVI by 75%. ALWAYS verify distance from bulb to basking surface and adjust if using Solarmeter 6.5. Too close = eye damage risk (especially albinos); too far = insufficient D3 synthesis."
    },
    {
      "type": "section",
      "title": "Measuring UVB Output (Optional But Recommended)"
    },
    {
      "type": "text",
      "content": "Solarmeter 6.5 UV Index Meter is the gold standard for measuring UVB output. While expensive ($200-250), it removes guesswork and ensures safe UVI levels."
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Using Solarmeter 6.5:</span>"
    },
    {
      "type": "list",
      "items": [
        "Turn on UVB fixture and allow 5 minutes to warm up (output stabilizes after warm-up)",
        "Hold Solarmeter at basking spot surface (where gecko's back will be positioned)",
        "Aim sensor upward toward UVB bulb",
        "Read UVI value on display - should show 1.0-2.0 for standard morphs, 0.5-0.7 for albinos",
        "If UVI too high: Increase fixture distance OR switch to lower-output bulb",
        "If UVI too low: Decrease fixture distance OR replace bulb (UVB degrades over time)",
        "Measure at multiple spots (left, center, right of basking area) to ensure even distribution"
      ]
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Without Solarmeter (Budget Option):</span>"
    },
    {
      "type": "list",
      "items": [
        "Follow manufacturer distance recommendations precisely - these are tested values",
        "Zoo Med T5 HO 5.0: 10-12\" through mesh = ~1.5 UVI (safe for standard morphs)",
        "Arcadia ShadeDweller: 6-8\" = ~0.7 UVI (safe for albinos)",
        "Monitor gecko behavior - if gecko avoids basking area entirely after UVB installation, may be too strong (increase distance)",
        "Replace bulb every 12 months even if still emitting light (UVB output degrades before visible light does)"
      ]
    },
    {
      "type": "section",
      "title": "Photoperiod Management"
    },
    {
      "type": "text",
      "content": "Photoperiod (light/dark cycle) regulates leopard gecko circadian rhythms, appetite, and breeding readiness. Consistent timing is more important than exact duration."
    },
    {
      "type": "table",
      "headers": ["Season/Purpose", "Photoperiod", "Setup Details", "Notes"],
      "rows": [
        ["Standard Year-Round", "12 hours light, 12 hours dark", "Timer turns UVB + heat lamp on at 7 AM, off at 7 PM (or any 12hr cycle)", "Simplest setup; works for most geckos"],
        ["Spring/Summer Simulation (Breeding)", "14 hours light, 10 hours dark", "Timer: 6 AM on, 8 PM off", "Mimics longer summer days; stimulates breeding behavior in mature geckos"],
        ["Fall/Winter Simulation (Cooling)", "10 hours light, 14 hours dark", "Timer: 8 AM on, 6 PM off", "Shorter days signal seasonal change; reduces appetite (natural brumation cue)"],
        ["Night Heating (If Needed)", "UVB/basking off, DHP/CHE on overnight", "UVB and halogen bulb OFF at night; Deep Heat Projector OR Ceramic Heat Emitter maintains 70-75F if room drops below 60F", "Night temps should drop naturally unless room too cold"]
      ]
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Timer Setup Instructions:</span>"
    },
    {
      "type": "list",
      "items": [
        "Use digital outlet timer (more reliable than mechanical dial timers)",
        "Program timer for 12hr on/off cycle (e.g., 7 AM on, 7 PM off)",
        "Plug BOTH heat lamp (halogen) and UVB fixture into timer - they should turn on/off together",
        "If using night heating (DHP or CHE), plug into SEPARATE timer OR leave on 24/7 regulated by thermostat",
        "Place timer in accessible location (not behind enclosure) for easy seasonal adjustments",
        "Test timer weekly - verify lights actually turn on/off at programmed times (battery backup recommended for power outages)"
      ]
    },
    {
      "type": "warning",
      "severity": "important",
      "content": "Do NOT Disturb Night Period: Leopard geckos require complete darkness for restful sleep. Avoid turning on room lights, checking gecko frequently, or providing red/blue night lights (geckos can see these wavelengths). Dark period = 12+ hours of uninterrupted darkness."
    },
    {
      "type": "highlight",
      "content": "Consistency Matters More Than Exact Times: Leopard geckos adapt to any 12hr photoperiod as long as timing is consistent daily. Set timer and leave it - changing times frequently disrupts circadian rhythm and causes stress."
    },
    {
      "type": "section",
      "title": "UVB Bulb Maintenance"
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Replacement Schedule:</span>"
    },
    {
      "type": "list",
      "items": [
        "<span class='font-semibold'>T5 HO Bulbs:</span> Replace every 12 months from install date (NOT when bulb burns out). UVB output degrades to ~50% after 12 months while visible light remains",
        "<span class='font-semibold'>ShadeDweller Compact Bulbs:</span> Replace every 12 months. Compact bulbs degrade faster than linear fluorescents",
        "<span class='font-semibold'>Mark Install Date:</span> Write date on fixture or in maintenance log - easy to forget when bulb was installed",
        "<span class='font-semibold'>Proactive Replacement:</span> Do NOT wait for bulb to burn out - UVB output fails long before visible light does"
      ]
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Cleaning & Maintenance:</span>"
    },
    {
      "type": "list",
      "items": [
        "Wipe bulb surface with dry microfiber cloth monthly - dust reduces UVB output by up to 30%",
        "Clean mesh screen lid monthly if T5 fixture mounted on top - dust accumulation blocks UVB",
        "Inspect fixture for damage quarterly - cracked bulbs or damaged fixtures must be replaced immediately",
        "Check electrical connections for corrosion or looseness - poor connections reduce output or cause flickering"
      ]
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Verifying Bulb Function:</span>"
    },
    {
      "type": "list",
      "items": [
        "Visible light does NOT confirm UVB output - bulb can emit light with zero UVB",
        "Only Solarmeter 6.5 can verify UVB output accurately",
        "Without Solarmeter: Replace on 12-month schedule regardless of visible light status",
        "Geckos showing MBD symptoms despite supplementation = possible UVB failure (vet check recommended)"
      ]
    },
    {
      "type": "section",
      "title": "Common Lighting Mistakes"
    },
    {
      "type": "table",
      "headers": ["Mistake", "Why It's a Problem", "Correct Approach"],
      "rows": [
        ["Using compact coil UVB bulbs (non-ShadeDweller)", "Older compact UVB bulbs caused eye damage; even newer ones have uneven UVB distribution", "Use T5 linear fluorescent (5.0) OR Arcadia ShadeDweller only"],
        ["Red or blue night lights", "Leopard geckos see red/blue light - disrupts sleep and stresses gecko", "Complete darkness at night; use ceramic heat emitter or DHP if night heating needed (no visible light)"],
        ["Keeping UVB on 24/7", "No dark period for rest; disrupts circadian rhythm, stresses gecko", "Use timer for 12hr on/off cycle"],
        ["Skipping UVB entirely", "Increases MBD risk even with D3 supplements; misses immune and behavioral benefits", "Provide appropriate UVB (1.0-2.0 UVI standard, 0.5-0.7 albino)"],
        ["Using same UVB intensity for all morphs", "Albino/leucistic morphs damaged by standard UVB levels (photo keratitis)", "Reduce UVI to 0.5-0.7 for albinos - increase fixture distance OR use ShadeDweller"],
        ["Separating UVB from heat source", "Gecko chooses heat over UVB (prioritizes thermoregulation), misses UVB exposure", "Position UVB to overlap basking zone - gecko receives both simultaneously"],
        ["Never replacing bulbs", "UVB output degrades to ineffective levels after 12 months while light remains", "Replace bulbs every 12 months regardless of visible light function"],
        ["Mounting ShadeDweller over mesh", "Mesh blocks 30%+ of already-low output - insufficient UVB reaches gecko", "Mount ShadeDweller INSIDE enclosure (not on top of mesh)"]
      ]
    },
    {
      "type": "section",
      "title": "Troubleshooting Lighting Issues"
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Gecko Avoids Basking Area After UVB Installation:</span>"
    },
    {
      "type": "list",
      "items": [
        "<span class='font-semibold'>Possible Cause:</span> UVB too strong (especially if albino morph with standard UVB level)",
        "<span class='font-semibold'>Solution:</span> Increase fixture distance 2-4 inches; measure with Solarmeter if available; switch to ShadeDweller for albinos"
      ]
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Gecko Develops Eye Cloudiness or Keeps Eyes Closed:</span>"
    },
    {
      "type": "list",
      "items": [
        "<span class='font-semibold'>Possible Cause:</span> Photokeratitis from excessive UVB (albino/leucistic morphs most susceptible)",
        "<span class='font-semibold'>Solution:</span> Immediately reduce UVB - increase distance OR switch to lower output; vet check required; may need UVB removed temporarily during healing"
      ]
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>Bulb Flickers or Won't Turn On:</span>"
    },
    {
      "type": "list",
      "items": [
        "<span class='font-semibold'>Possible Cause:</span> Bulb failure, loose connections, or ballast failure in fixture",
        "<span class='font-semibold'>Solution:</span> Try new bulb first (cheapest fix); if flickering persists, replace fixture; check electrical connections for corrosion"
      ]
    },
    {
      "type": "text",
      "text": "<span class='text-base font-semibold text-gray-900 dark:text-white block mb-2'>MBD Symptoms Despite UVB and Supplements:</span>"
    },
    {
      "type": "list",
      "items": [
        "<span class='font-semibold'>Possible Causes:</span> UVB bulb degraded (past 12 months), insufficient basking temp (gecko not absorbing UVB effectively), parasites preventing nutrient absorption",
        "<span class='font-semibold'>Solution:</span> Replace UVB bulb immediately; verify basking temps 94-97F; fecal exam for parasites; vet check for injectable calcium if severe"
      ]
    }
  ]
}
